#include <stdio.h> // เรียกใช้ไลบรารีมาตรฐานสำหรับฟังก์ชัน

int main() {      // main function
    float score = 90.5; // Data type float
    printf("float score = %f\n", score); // แสดงเลขทศนิยม
    return 0; // จบโปรแกรม
}
// 1.ผลลัพธ์ที่ได้ต่างกันอย่างไร Ans ได้ 90.5 ผลลัพธ์ถูกต้อง
/*2.ทำไมต้องเลือก Data Type ให้ถูกต้อง? Ansเพื่อให้ได้คำตอบที่ถูกต้องและเพราะเป็นส่วนที่ถูกกำหนดว่าเราสามารถเก็ฐข้อมูลประเภทไหนได้บ้าง
 โดย กรณีที่จะเก็บทศนิยม จะต้องใช้ ประเภท float ซึ่งกรณีที่2 ใช้ได้ถูกต้อง*/
 //3.อภิปรายและสรุปผลทีได้จากการทดลอง Ans กรณีที่2 การใช้data type Float กับค่าทศนิยมถูกต้องและเหมาะสมกับการใช้งาน