#include <stdio.h> // เรียกใช้ไลบรารีมาตรฐานสำหรับฟังก์ชัน

int main() {       // main function
    int score = 90.5; // Data type int
    printf("int score = %d\n", score); // แสดงตัวเลขจำนวนเต็ม
    return 0; // จบโปรแกรม
}
// 1. ผลลัพธ์ที่ได้ต่างกันอย่างไร? Ans กรณีที่1 ผลลัพธ์จะได้ = 90 เพราะ int หรือ integer คือ จำนวนเต็ม จะไม่มีจุดทศนิยม
// 2. ทำไมต้องเลือกData Type ให้ถูกต้อง Ansเพื่อให้ได้คำตอบที่ถูกต้องและเพราะเป็นส่วนที่ถูกกำหนดว่าเราสามารถเก็ฐข้อมูลประเภทไหนได้บ้าง โดย กรณีที่จะเก็บทศนิยม จะต้องใช้ ประเภท float
/*3. อภิปรายและสรุปผลที่ได้จากการทดลอง Ans ถ้าเราใช้ int กับค่าทศนิยม จะถูกตัค่าตรงช่วงทศนิยมทิ้ง ซึ่งจะทำให้ข้อมูลผิดได้ 
ดังนั้นเราจึงควรเลือกประเภทของ Data type ให้เหมาะสมกับการใช้งาน*/